## EVA GARCIA DOMINGO

In [1]:
%load_ext sql
%sql sqlite:///Baloncesto.db

/usr/local/lib/python3.4/dist-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/usr/local/lib/python3.4/dist-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

'Connected: None@Baloncesto.db'

![Diagrama E/R](ER_2.jpg),

In [2]:
%%sql
CREATE TABLE Participante
(nif VARCHAR(10),
nombre VARCHAR(30),
primer_apell VARCHAR(30),
seg_apell VARCHAR(30),
fecha_nac DATETIME,
PRIMARY KEY (nif));

Done.

[]

In [3]:
%%sql
CREATE TABLE Entrenador 
(nif VARCHAR(10),
PRIMARY KEY (nif),
FOREIGN KEY (nif) REFERENCES Participante(nif));

Done.

[]

In [25]:
%%sql
DROP TABLE Jugador;
CREATE TABLE Jugador 
(nif VARCHAR(10),
 estatura FLOAT,
 equipo VARCHAR(50) NOT NULL,
PRIMARY KEY (nif),
FOREIGN KEY (equipo) REFERENCES Equipo(nombre),
FOREIGN KEY (nif) REFERENCES Participante(nif));

Done.
Done.

[]

In [5]:
%%sql
INSERT INTO Participante (nif, nombre, primer_apell, seg_apell, fecha_nac)
VALUES('12345678L', 'Juan', 'Ramirez', 'Garcia', "1992-12-15 12:00:00");

INSERT INTO Participante (nif, nombre, primer_apell, fecha_nac)
VALUES('87654321S', 'Pedro', 'Gasol', "1980-03-02 12:00:00");

INSERT INTO Participante (nif, nombre, primer_apell, seg_apell, fecha_nac)
VALUES('87125476P', 'Jorge', 'Gordon', 'Llamo', "1992-02-28 01:00:00");

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [26]:
%%sql
INSERT INTO Jugador (nif, estatura, equipo) VALUES ('12345678L', 1.85, 'Estudiantes');
INSERT INTO Jugador (nif, estatura, equipo) VALUES ('87125476P', 1.90, 'Real Madrid');

1 rows affected.
1 rows affected.

[]

In [12]:
%sql INSERT INTO Entrenador(nif) VALUES ('87654321S');

1 rows affected.

[]

In [13]:
%sql SELECT * FROM Participante

Done.

[('12345678L', 'Juan', 'Ramirez', 'Garcia', '1992-12-15 12:00:00'),
 ('87654321S', 'Pedro', 'Gasol', None, '1980-03-02 12:00:00'),
 ('87125476P', 'Jorge', 'Gordon', 'Llamo', '1992-02-28 01:00:00')]

In [22]:
%%sql 
CREATE TABLE Ciudad
(nombre VARCHAR(50),
comunidad VARCHAR(50),
PRIMARY KEY (nombre, comunidad))

Done.

[]

In [37]:
%%sql
INSERT INTO Ciudad (nombre, comunidad)
VALUES ('Alcala', 'Madrid');

INSERT INTO Ciudad (nombre, comunidad)
VALUES ('Alcala', 'Granada');

INSERT INTO Ciudad (nombre, comunidad)
VALUES ('Madrid', 'Madrid');

INSERT INTO Ciudad (nombre, comunidad)
VALUES ('Navalcarnero', 'Madrid');

INSERT INTO Ciudad (nombre, comunidad)
VALUES ('Bilbao', 'Euskadi');

INSERT INTO Ciudad (nombre, comunidad)
VALUES ('Donosti', 'Euskadi');

INSERT INTO Ciudad (nombre, comunidad)
VALUES ('Vallecas', 'Madrid');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [23]:
%%sql
CREATE TABLE Equipo
(nombre VARCHAR (50),
nombre_ciudad VARCHAR(50),
CA_ciudad VARCHAR(50),
PRIMARY KEY (nombre, nombre_ciudad, CA_ciudad),
FOREIGN KEY (nombre_ciudad) REFERENCES Ciudad(nombre),
FOREIGN KEY (CA_ciudad) REFERENCES Ciudad(comunidad))

Done.

[]

In [38]:
%%sql
INSERT INTO Equipo (nombre, nombre_ciudad, CA_ciudad)
VALUES ('Estudiantes', 'Madrid', 'Madrid');

INSERT INTO Equipo (nombre, nombre_ciudad, CA_ciudad)
VALUES ('Bilbao Basket', 'Bilbao', 'Euskadi');

INSERT INTO Equipo (nombre, nombre_ciudad, CA_ciudad)
VALUES ('Ensanche de Vallecas', 'Vallecas', 'Madrid');

INSERT INTO Equipo (nombre, nombre_ciudad, CA_ciudad)
VALUES ('Real Madrid', 'Madrid', 'Madrid');

INSERT INTO Equipo (nombre, nombre_ciudad, CA_ciudad)
VALUES ('Atletico de Madrid', 'Madrid', 'Madrid');

INSERT INTO Equipo (nombre, nombre_ciudad, CA_ciudad)
VALUES ('Donosti Basket', 'Donosti', 'Euskadi');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
SELECT Equipo.nombre, nombre_ciudad AS 'Ciudad', CA_ciudad AS 'Comunidad_autonoma'
FROM Equipo
JOIN Ciudad
ON Equipo.nombre_ciudad = Ciudad.nombre

Done.

[('Estudiantes', 'Madrid', 'Madrid'),
 ('Bilbao Basket', 'Bilbao', 'Euskadi'),
 ('Ensanche de Vallecas', 'Vallecas', 'Madrid'),
 ('Real Madrid', 'Madrid', 'Madrid'),
 ('Atletico de Madrid', 'Madrid', 'Madrid'),
 ('Donosti Basket', 'Donosti', 'Euskadi')]

In [49]:
%%sql
SELECT Ciudad.nombre AS 'Ciudad', Ciudad.comunidad AS 'Comunidad_autonoma', Equipo.nombre AS 'Equipo'
FROM Ciudad
LEFT JOIN Equipo
ON Equipo.nombre_ciudad = Ciudad.nombre

Done.

[('Alcala', 'Madrid', None),
 ('Alcala', 'Granada', None),
 ('Madrid', 'Madrid', 'Atletico de Madrid'),
 ('Madrid', 'Madrid', 'Estudiantes'),
 ('Madrid', 'Madrid', 'Real Madrid'),
 ('Navalcarnero', 'Madrid', None),
 ('Bilbao', 'Euskadi', 'Bilbao Basket'),
 ('Donosti', 'Euskadi', 'Donosti Basket'),
 ('Vallecas', 'Madrid', 'Ensanche de Vallecas')]

In [25]:
%sql PRAGMA table_info(Equipo)

Done.

[(0, 'nombre', 'VARCHAR (50)', 0, None, 1),
 (1, 'nombre_ciudad', 'VARCHAR(50)', 0, None, 2),
 (2, 'CA_ciudad', 'VARCHAR(50)', 0, None, 3)]

In [27]:
%%sql
CREATE TABLE Cancha
(nombre VARCHAR(20),
direccion VARCHAR (60),
nombre_ciudad VARCHAR(50),
CA_ciudad VARCHAR(50),
PRIMARY KEY (nombre, nombre_ciudad, CA_ciudad),
FOREIGN KEY (nombre_ciudad) REFERENCES Ciudad(nombre),
FOREIGN KEY (CA_ciudad) REFERENCES Ciudad(comunidad))

Done.

[]

In [5]:
%sql SELECT * FROM Ciudad

Done.

[('Alcala', 'Madrid'),
 ('Alcala', 'Granada'),
 ('Madrid', 'Madrid'),
 ('Navalcarnero', 'Madrid'),
 ('Bilbao', 'Euskadi'),
 ('Donosti', 'Euskadi'),
 ('Vallecas', 'Madrid')]

In [7]:
%sql Select * FROM Equipo

Done.

[('Estudiantes', 'Madrid', 'Madrid'),
 ('Bilbao Basket', 'Bilbao', 'Euskadi'),
 ('Ensanche de Vallecas', 'Vallecas', 'Madrid'),
 ('Real Madrid', 'Madrid', 'Madrid'),
 ('Atletico de Madrid', 'Madrid', 'Madrid'),
 ('Donosti Basket', 'Donosti', 'Euskadi')]

In [8]:
%%sql
INSERT INTO Cancha (nombre, direccion, nombre_ciudad, CA_ciudad)
VALUES ('A', 'Askatasuna Etorb, 13', 'Bilbao', 'Euskadi');

INSERT INTO Cancha (nombre, direccion, nombre_ciudad, CA_ciudad)
VALUES ('B', 'C/ Hortaleza, 1', 'Madrid', 'Madrid');

INSERT INTO Cancha (nombre, direccion, nombre_ciudad, CA_ciudad)
VALUES ('C', 'Camino Sintra, s/n' , 'Madrid', 'Madrid');

INSERT INTO Cancha (nombre, direccion, nombre_ciudad, CA_ciudad)
VALUES ('D', 'Paseo de la Virgen del puerto, 67', 'Madrid', 'Madrid');

INSERT INTO Cancha (nombre, direccion, nombre_ciudad, CA_ciudad)
VALUES ('E', 'C/ Felipe Alvarez, 3', 'Vallecas', 'Madrid');

INSERT INTO Cancha (nombre, direccion, nombre_ciudad, CA_ciudad)
VALUES ('F', 'Paseo de Anoeta, 22', 'Donosti', 'Euskadi');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

En la relacion entrena_en, cuando un entrenador deje de entrenar a un equipo, habrá que cambiar fecha_fin
(por defecto null) y añadir luego la entrada para el entrenador nuevo.

Habrá que especificar al usuario que añada entradas que un equipo tiene que tener obligatoriamente una cancha 
asociada

In [34]:
%%sql
CREATE TABLE Entrena_en
(nif_entrenador VARCHAR(10),
cancha VARCHAR(20),
equipo VARCHAR(50),
inicio DATETIME,
fin DATETIME,
PRIMARY KEY (nif_entrenador, cancha, equipo)
FOREIGN KEY (nif_entrenador) REFERENCES Entrenador (nif),
FOREIGN KEY (cancha) REFERENCES Cancha(nombre),
FOREIGN KEY (equipo) REFERENCES Equipo (nombre))

Done.

[]

In [9]:
%sql SELECT * FROM Entrenador

Done.

[('87654321S',)]

In [10]:
%%sql 
INSERT INTO Participante (nif, nombre, primer_apell, seg_apell, fecha_nac)
VALUES('34566688S', 'Sergio', 'Valdeolmillos', 'Moreno', "1967-04-04 12:00:00");

INSERT INTO Participante (nif, nombre, primer_apell, fecha_nac)
VALUES('34293589K', 'Pablo', 'Laso', "1967-10-13 12:00:00");

INSERT INTO Participante (nif, nombre, primer_apell, fecha_nac)
VALUES('14312129P', 'Jesus', 'Gil', "1933-03-12 12:00:00");

INSERT INTO Participante (nif, nombre, primer_apell, fecha_nac)
VALUES('87125000P', 'Alexander', 'Theriault', "0000-00-00 01:00:00");

INSERT INTO Participante (nif, nombre, primer_apell, fecha_nac)
VALUES('76129834J', 'Carles', 'Duran', "1976-01-15 01:00:00");

INSERT INTO Participante (nif, nombre, primer_apell, fecha_nac)
VALUES('77125000P', 'Sergio', 'Beristain', "0000-00-00 01:00:00");

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
INSERT INTO Entrenador(nif) VALUES ('34566688S');
INSERT INTO Entrenador(nif) VALUES ('34293589K');
INSERT INTO Entrenador(nif) VALUES ('14312129P');
INSERT INTO Entrenador(nif) VALUES ('87125000P');
INSERT INTO Entrenador(nif) VALUES ('76129834J');
INSERT INTO Entrenador(nif) VALUES ('77125000P');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%sql SELECT * FROM Cancha;

Done.

[('A', 'Askatasuna Etorb, 13', 'Bilbao', 'Euskadi'),
 ('B', 'C/ Hortaleza, 1', 'Madrid', 'Madrid'),
 ('C', 'Camino Sintra, s/n', 'Madrid', 'Madrid'),
 ('D', 'Paseo de la Virgen del puerto, 67', 'Madrid', 'Madrid'),
 ('E', 'C/ Felipe Alvarez, 3', 'Vallecas', 'Madrid'),
 ('F', 'Paseo de Anoeta, 22', 'Donosti', 'Euskadi')]

In [17]:
%sql SELECT * FROM Entrenador JOIN Participante ON Entrenador.nif = Participante.nif;

Done.

[('87654321S', '87654321S', 'Pedro', 'Gasol', None, '1980-03-02 12:00:00'),
 ('34566688S', '34566688S', 'Sergio', 'Valdeolmillos', 'Moreno', '1967-04-04 12:00:00'),
 ('34293589K', '34293589K', 'Pablo', 'Laso', None, '1967-10-13 12:00:00'),
 ('14312129P', '14312129P', 'Jesus', 'Gil', None, '1933-03-12 12:00:00'),
 ('87125000P', '87125000P', 'Alexander', 'Theriault', None, '0000-00-00 01:00:00'),
 ('76129834J', '76129834J', 'Carles', 'Duran', None, '1976-01-15 01:00:00'),
 ('77125000P', '77125000P', 'Sergio', 'Beristain', None, '0000-00-00 01:00:00')]

In [16]:
%sql SELECT * FROM Equipo

Done.

[('Estudiantes', 'Madrid', 'Madrid'),
 ('Bilbao Basket', 'Bilbao', 'Euskadi'),
 ('Ensanche de Vallecas', 'Vallecas', 'Madrid'),
 ('Real Madrid', 'Madrid', 'Madrid'),
 ('Atletico de Madrid', 'Madrid', 'Madrid'),
 ('Donosti Basket', 'Donosti', 'Euskadi')]

In [18]:
%%sql 
INSERT INTO Entrena_en (nif_entrenador, cancha, equipo, inicio)
VALUES ('34566688S', 'B', 'Estudiantes', '2016-09-01 00:00:00');

INSERT INTO Entrena_en (nif_entrenador, cancha, equipo, inicio)
VALUES ('34293589K', 'C', 'Real Madrid', '2016-09-01 00:00:00');

INSERT INTO Entrena_en (nif_entrenador, cancha, equipo, inicio)
VALUES ('14312129P', 'D', 'Aletico de Madrid', '2016-09-01 00:00:00');

INSERT INTO Entrena_en (nif_entrenador, cancha, equipo, inicio)
VALUES ('87125000P', 'E', 'Ensanche de Vallecas', '2016-09-01 00:00:00');

INSERT INTO Entrena_en (nif_entrenador, cancha, equipo, inicio)
VALUES ('76129834J', 'A', 'Bilbao Basket', '2016-09-01 00:00:00');

INSERT INTO Entrena_en (nif_entrenador, cancha, equipo, inicio)
VALUES ('77125000P', 'F', 'Donosti Basket', '2016-09-01 00:00:00');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [35]:
%%sql
CREATE TABLE Empresa
(nombre VARCHAR (50),
cif VARCHAR(15),
PRIMARY KEY (cif))

Done.

[]

In [19]:
%%sql 
INSERT INTO Empresa (nombre, cif)
VALUES ('DOMINION', 'A58818501');

INSERT INTO Empresa (nombre, cif)
VALUES ('IDK Elektronika', 'A58534501');

INSERT INTO Empresa (nombre, cif)
VALUES ('Adidas', 'A12393351');

1 rows affected.
1 rows affected.
1 rows affected.

[]

De esta forma, una empresa puede patrocinar a varios equipos y un equipo puede ser patrocinado por varias empresas pero solo hay una pareja de empresa-equipo (siendo este equipo el de una ciudad, ya que puede haber varios equipos con el mismo nombre)

In [36]:
%%sql
CREATE TABLE Patrocina_eq
(cif VARCHAR(15),
equipo VARCHAR(50),
nombre_ciudad VARCHAR(50),
CA_ciudad VARCHAR(50),
PRIMARY KEY (cif, equipo, nombre_ciudad, CA_ciudad),
FOREIGN KEY (nombre_ciudad) REFERENCES Ciudad(nombre),
FOREIGN KEY (CA_ciudad) REFERENCES Ciudad(comunidad),
FOREIGN KEY (cif) REFERENCES Empresa(cif),
FOREIGN KEY (equipo) REFERENCES Equipo(nombre))

Done.

[]

In [20]:
%%sql
INSERT INTO Patrocina_eq (cif, equipo, nombre_ciudad, CA_ciudad)
VALUES ('A58818501', 'Bilbao Basket', 'Bilbao', 'Euskadi');

INSERT INTO Patrocina_eq (cif, equipo, nombre_ciudad, CA_ciudad)
VALUES ('A58534501', 'Donosti Basket', 'Donosti', 'Euskadi');

INSERT INTO Patrocina_eq (cif, equipo, nombre_ciudad, CA_ciudad)
VALUES ('A12393351', 'Real Madrid', 'Madrid', 'Madrid');

1 rows affected.
1 rows affected.
1 rows affected.

[]

![Diagrama E/R](ER_3.jpg)

Editada tabla Jugador para que contenga el equipo al que pertence

In [24]:
%sql SELECT * FROM Jugador

Done.

[('12345678L', 1.85, 'Estudiantes'), ('87125476P', 1.9, 'Real Madrid')]

In [10]:
%%sql 
DROP TABLE Partido;
CREATE TABLE Partido
(id INTEGER PRIMARY KEY AUTOINCREMENT,
inicio DATETIME,
fin DATETIME,
primer_tiempo INT,
seg_tiempo INT,
tercer_tiempo INT,
cuarto_tiempo INT,
FOREIGN KEY (primer_tiempo) REFERENCES Tiempo(id),
FOREIGN KEY (seg_tiempo) REFERENCES Tiempo(id),
FOREIGN KEY (tercer_tiempo) REFERENCES Tiempo(id),
FOREIGN KEY (cuarto_tiempo) REFERENCES Tiempo(id));

Done.
Done.

[]

In [15]:
%%sql
INSERT INTO Partido (inicio, fin, primer_tiempo, seg_tiempo, tercer_tiempo, cuarto_tiempo)
VALUES ('2016-09-01 20:00:00', '2016-09-01 21:45:30',1, 2, 3, 4);

INSERT INTO Partido (inicio, fin, primer_tiempo, seg_tiempo, tercer_tiempo, cuarto_tiempo)
VALUES ('2016-09-01 20:00:00', '2016-09-01 21:43:00', 5, 6, 7, 8);

INSERT INTO Partido (inicio, fin, primer_tiempo, seg_tiempo, tercer_tiempo, cuarto_tiempo)
VALUES ('2016-09-08 19:30:00', '2016-09-01 21:16:10', 9, 10, 11, 12);

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%sql SELECT * FROM Partido

Done.

[(1, '2016-09-01 20:00:00', '2016-09-01 21:45:30', 1, 2, 3, 4),
 (2, '2016-09-01 20:00:00', '2016-09-01 21:43:00', 5, 6, 7, 8),
 (3, '2016-09-08 19:30:00', '2016-09-01 21:16:10', 9, 10, 11, 12)]

In [37]:
%%sql
DROP TABLE Juega;
CREATE TABLE Juega
(equipo1 VARCHAR(50) NOT NULL,
equipo2 VARCHAR(50) NOT NULL,
partido_id INTEGER NOT NULL,
cancha VARCHAR(30),
PRIMARY KEY (equipo1, equipo2, partido_id),
FOREIGN KEY (equipo1) REFERENCES Equipo(nombre),
FOREIGN KEY (equipo2) REFERENCES Equipo(nombre),
FOREIGN KEY (partido_id) REFERENCES Partido(id),
FOREIGN KEY (cancha) REFERENCES Cancha(nombre));

Done.
Done.

[]

In [30]:
%sql PRAGMA table_info (Juega)

Done.

[(0, 'equipo1', 'VARCHAR(50)', 0, None, 1),
 (1, 'equipo2', 'VARCHAR(50)', 0, None, 2),
 (2, 'partido_id', 'INTEGER', 0, None, 3),
 (3, 'cancha_nombre', 'VARCHAR(30)', 0, None, 0)]

In [33]:
%sql SELECT * FROM Equipo

Done.

[('Estudiantes', 'Madrid', 'Madrid'),
 ('Bilbao Basket', 'Bilbao', 'Euskadi'),
 ('Ensanche de Vallecas', 'Vallecas', 'Madrid'),
 ('Real Madrid', 'Madrid', 'Madrid'),
 ('Atletico de Madrid', 'Madrid', 'Madrid'),
 ('Donosti Basket', 'Donosti', 'Euskadi')]

In [34]:
%sql SELECT * FROM Cancha

Done.

[('A', 'Askatasuna Etorb, 13', 'Bilbao', 'Euskadi'),
 ('B', 'C/ Hortaleza, 1', 'Madrid', 'Madrid'),
 ('C', 'Camino Sintra, s/n', 'Madrid', 'Madrid'),
 ('D', 'Paseo de la Virgen del puerto, 67', 'Madrid', 'Madrid'),
 ('E', 'C/ Felipe Alvarez, 3', 'Vallecas', 'Madrid'),
 ('F', 'Paseo de Anoeta, 22', 'Donosti', 'Euskadi')]

In [38]:
%%sql
INSERT INTO Juega(equipo1, equipo2, partido_id, cancha)
VALUES ('Real Madrid', 'Estudiantes', 1, 'C');

INSERT INTO Juega(equipo1, equipo2, partido_id, cancha)
VALUES ('Donosti Basket', 'Bilbao Basket', 2, 'F');

INSERT INTO Juega(equipo1, equipo2, partido_id, cancha)
VALUES ('Real Madrid', 'Bilbao Basket', 3, 'A');

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
DROP TABLE Posicion;
CREATE TABLE Posicion
(id INTEGER PRIMARY KEY AUTOINCREMENT,
nombre VARCAHR(20),
inicio DATETIME,
fin DATETIME);

Done.
Done.

[]

Para añadir la posicion en la que ha jugado un jugador durante un periodo de tiempo de un partido, habrá que añadir primero en la tabla 'posicion' y luego añadirlo en la tabla 'jugó', para que no sea un atributo de esta relacion (tal posicion en tal periodo es un triplete propio y hay que guardarlos todos de cada partido)

In [3]:
%sql SELECT * FROM Partido

Done.

[(1, '2016-09-01 20:00:00', '2016-09-01 21:45:30'),
 (2, '2016-09-01 20:00:00', '2016-09-01 21:43:00'),
 (3, '2016-09-08 19:30:00', '2016-09-01 21:16:10')]

In [12]:
%%sql
INSERT INTO Posicion (nombre, inicio, fin)
VALUES ('pivot', '2016-09-01 20:00:00', '2016-09-01 20:15:10');

INSERT INTO Posicion (nombre, inicio, fin)
VALUES ('base', '2016-09-01 20:35:00', '2016-09-01 20:50:10');

INSERT INTO Posicion (nombre, inicio, fin)
VALUES ('alero', '2016-09-08 20:10:00', '2016-09-08 20:25:35');

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%%sql
CREATE TABLE Jugo_partido 
(partido INTEGER,
posicion INT,
jugador_nif VARCHAR(10),
peso FLOAT,
FOREIGN KEY (partido) REFERENCES Partido(partido_id),
FOREIGN KEY (posicion) REFERENCES Partido (id),
FOREIGN KEY (jugador_nif) REFERENCES Jugador(nif))

Done.

[]

In [10]:
%sql SELECT * FROM Jugador

Done.

[('12345678L', 1.85, 'Estudiantes'), ('87125476P', 1.9, 'Real Madrid')]

In [20]:
%%sql
INSERT INTO Jugo_partido (partido, posicion, jugador_nif, peso)
VALUES (1, 1, '12345678L', 90.0);

INSERT INTO Jugo_partido (partido, posicion, jugador_nif, peso)
VALUES (1, 2, '12345678L', 90.0);

INSERT INTO Jugo_partido (partido, posicion, jugador_nif, peso)
VALUES (2, 3, '87125476P', 85.2);

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
%%sql
SELECT * FROM Jugador
JOIN Jugo_partido
ON Jugador.nif = Jugo_partido.jugador_nif

Done.

[('12345678L', 1.85, 'Estudiantes', 1, 1, '12345678L', 90.0),
 ('12345678L', 1.85, 'Estudiantes', 1, 2, '12345678L', 90.0),
 ('87125476P', 1.9, 'Real Madrid', 2, 3, '87125476P', 85.2)]

![DiagramaE/R](ER_4.jpg)

In [2]:
%%sql
CREATE TABLE Jugada
(id INTEGER PRIMARY KEY AUTOINCREMENT,
inicio DATETIME,
fin DATETIME)

Done.

[]

In [74]:
%%sql
INSERT INTO Jugada (inicio, fin)
VALUES ('2016-09-01 20:10:03', '2016-09-01 20:10:50');

INSERT INTO Jugada (inicio, fin)
VALUES ('2016-09-01 21:04:13', '2016-09-01 21:05:50');

INSERT INTO Jugada (inicio, fin)
VALUES ('2016-09-08 20:10:03', '2016-09-01 20:10:50');

INSERT INTO Jugada (inicio, fin)
VALUES ('2016-09-01 21:40:03', '2016-09-01 20:41:50');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
DROP TABLE Jug_cambio_posicion;
CREATE TABLE Jug_cambio_posicion
(id INTEGER,
jugador_nif VARCHAR(10),
coor_x FLOAT,
coor_y FLOAT,
PRIMARY KEY (id),
FOREIGN KEY (id) REFERENCES Jugada(id),
FOREIGN KEY (jugador_nif) REFERENCES Jugador(nif))

Done.
Done.

[]

In [6]:
%%sql
CREATE TABLE Jug_defensiva
(id INTEGER,
jug_defensor VARCHAR(10),
jug_defendido VARCHAR(10),
PRIMARY KEY (id),
FOREIGN KEY (id) REFERENCES Jugada(id),
FOREIGN KEY (jug_defensor) REFERENCES Jugador(nif),
FOREIGN KEY (jug_defendido) REFERENCES Jugador(nif))

Done.

[]

In [7]:
%%sql
CREATE TABLE Sucede_en
(jugada INT,
partido INT,
PRIMARY KEY (jugada, partido))

Done.

[]

In [8]:
%%sql
CREATE TABLE Record
(jugador_nif VARCHAR(10),
partido INT,
jugada INT,
tipo VARCHAR(50),
PRIMARY KEY (jugador_nif, partido, jugada),
FOREIGN KEY (jugador_nif) REFERENCES Jugador(nif),
FOREIGN KEY (partido) REFERENCES Partido(id),
FOREIGN KEY (jugada) REFERENCES Jugada(id))

Done.

[]

In [76]:
%%sql 
INSERT INTO Record (jugador_nif, partido, jugada, tipo)
VALUES ('12345678L', 1, 1, 'maxima puntuacion');

INSERT INTO Record (jugador_nif, partido, jugada, tipo)
VALUES ('12345678L', 1, 2, 'maxima puntuacion');

INSERT INTO Record (jugador_nif, partido, jugada, tipo)
VALUES ('12345678L', 2, 3, 'maxima puntuacion');

INSERT INTO Record (jugador_nif, partido, jugada, tipo)
VALUES ('87125476P', 1, 4, 'rebotes');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [72]:
%sql SELECT * FROM Jugador

Done.

[('12345678L', 1.85, 'Estudiantes'), ('87125476P', 1.9, 'Real Madrid')]

In [75]:
%sql SELECT * FROM Jugada

Done.

[(1, '2016-09-01 20:10:03', '2016-09-01 20:10:50'),
 (2, '2016-09-01 21:04:13', '2016-09-01 21:05:50'),
 (3, '2016-09-08 20:10:03', '2016-09-01 20:10:50'),
 (4, '2016-09-01 21:40:03', '2016-09-01 20:41:50')]

![Diagrama E/R](ER_5.jpg)

In [13]:
%%sql 
DROP TABLE Tiempo;
CREATE TABLE Tiempo 
(id INTEGER PRIMARY KEY AUTOINCREMENT,
inicio DATETIME,
fin DATETIME,
puntuacion VARCHAR(10))

Done.
Done.

[]

Edito la tabla de Partido para meter la informacion de los tiempos

In [14]:
%%sql
INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 20:00:00', '2016-09-01 20:21:00', '10-23');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 20:30:00', '2016-09-01 20:41:00', '30-36');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 21:10:00', '2016-09-01 21:25:00', '50-48');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 21:30:00', '2016-09-01 21:45:30', '60-65');


INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 20:00:00', '2016-09-01 20:21:00', '7-15');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 20:30:00', '2016-09-01 20:41:00', '20-40');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 21:10:00', '2016-09-01 21:25:00', '30-60');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-01 21:30:00', '2016-09-01 21:45:30', '43-70');


INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-08 19:33:00', '2016-09-08 19:35:30', '20-15');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-08 19:50:00', '2016-09-08 20:01:50', '30-36');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-08 20:40:00', '2016-09-08 20:51:00', '50-48');

INSERT INTO Tiempo (inicio, fin, puntuacion)
VALUES ('2016-09-08 21:03:00', '2016-09-08 21:15:30', '60-65');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%sql SELECT * FROM Tiempo

Done.

[(1, '2016-09-01 20:00:00', '2016-09-01 20:21:00', '10-23'),
 (2, '2016-09-01 20:30:00', '2016-09-01 20:41:00', '30-36'),
 (3, '2016-09-01 21:10:00', '2016-09-01 21:25:00', '50-48'),
 (4, '2016-09-01 21:30:00', '2016-09-01 21:45:30', '60-65'),
 (5, '2016-09-01 20:00:00', '2016-09-01 20:21:00', '7-15'),
 (6, '2016-09-01 20:30:00', '2016-09-01 20:41:00', '20-40'),
 (7, '2016-09-01 21:10:00', '2016-09-01 21:25:00', '30-60'),
 (8, '2016-09-01 21:30:00', '2016-09-01 21:45:30', '43-70'),
 (9, '2016-09-08 19:33:00', '2016-09-08 19:35:30', '20-15'),
 (10, '2016-09-08 19:50:00', '2016-09-08 20:01:50', '30-36'),
 (11, '2016-09-08 20:40:00', '2016-09-08 20:51:00', '50-48'),
 (12, '2016-09-08 21:03:00', '2016-09-08 21:15:30', '60-65')]

# Tercera parte; queries

## 1 - Los jugadores que han jugado un partido dado y pesan más de 85 kg

In [71]:
%%sql
SELECT peso, nif, equipo FROM Jugo_partido
JOIN Jugador 
ON Jugo_partido.jugador_nif = Jugador.nif
WHERE Jugo_partido.peso >= 85.0 AND Jugo_partido.partido = 1

Done.

[(90.0, '12345678L', 'Estudiantes'), (90.0, '12345678L', 'Estudiantes')]

## 2 - Los jugadores que han jugado en la posicion Pivot en un partido (1)

In [14]:
%%sql
SELECT jugador_nif FROM Jugo_partido
JOIN Posicion
ON Jugo_partido.posicion = Posicion.id
WHERE Posicion.nombre = 'pivot'

Done.

[('12345678L',)]

## 8 - Puntuacion en un instante (determinado) de un partido (dado). Con esta implementacion, tendrán que decirnos de qué cuarto es el instante.

In [26]:
%%sql
SELECT Tiempo.puntuacion FROM Partido
JOIN Tiempo
ON (primer_tiempo <= '2016-09-01 20:03:00') 
WHERE Partido.id = 1 AND primer_tiempo = Tiempo.id

Done.

[('10-23',)]

# 11- Numero de puntos conseguido por un equipo en un partido.

In [47]:
%%sql
SELECT
Tiempo.Puntuacion
FROM Partido
JOIN Tiempo
ON Partido.id = 1
WHERE (primer_tiempo = Tiempo.id 
    OR seg_tiempo = Tiempo.id
    OR tercer_tiempo = Tiempo.id
    OR cuarto_tiempo = Tiempo.id)

Done.

[('10-23',), ('30-36',), ('50-48',), ('60-65',)]

## 12 - Numero de puntos conseguido por un equipo en un tiempo de un partido.
(suponemos que nos dicen que tiempo de qué partido quiere)

In [49]:
%%sql
SELECT
Tiempo.Puntuacion
FROM Partido
JOIN Tiempo
ON Partido.id = 2 
WHERE Tiempo.id = 
(SELECT primer_tiempo
 FROM Partido
 WHERE Partido.id = 2)

Done.

[('7-15',)]

## 13 - Numero de partidos jugados en una cancha.

In [63]:
%%sql
SELECT Count(Juega.partido_id)
FROM Juega
WHERE cancha = 'A'

Done.

[(1,)]

In [57]:
%%sql
SELECT Count(Juega.partido_id)
FROM Juega
WHERE cancha = 'B'

Done.

[(0,)]

## 15 - Historial de los equipos entrenados por un entrenador

In [70]:
%%sql
SELECT equipo
FROM Entrena_en
WHERE Entrena_en.nif_entrenador = 
(SELECT nif 
FROM Participante
WHERE Participante.nombre = 'Pablo' AND Participante.primer_apell = 'Laso')

Done.

[('Real Madrid',)]

## 3 - Todos los records conseguidos por jugadores relativos a maxima puntuacion alcanzada en una temporada

In [83]:
%%sql
SELECT inicio, fin
FROM Record
JOIN Jugada
ON Record.tipo = 'maxima puntuacion'
GROUP BY Jugada

Done.

[('2016-09-01 21:40:03', '2016-09-01 20:41:50'),
 ('2016-09-01 21:40:03', '2016-09-01 20:41:50'),
 ('2016-09-01 21:40:03', '2016-09-01 20:41:50')]